In [13]:
import pandas as pd
from sqlalchemy import create_engine
import sys

In [14]:
DATABASE_CONFIG = {
    'host': '10.0.10.31',
    'port': 3310,
    'user': 'root',
    'password': 'root',
    'database': 'retail_db'
}

In [15]:
def create_db_engine(config):
    """
    """
    try:
        engine = create_engine(f"mysql://{config['user']}:{config['password']}@{config['host']}:{config['port']}/{config['database']}")
        return engine
    except Exception as e:
        print(e)

In [16]:
create_db_engine(DATABASE_CONFIG)

Engine(mysql://root:***@10.0.10.31:3310/retail_db)

In [17]:
def read_csv(file_path, columns):
    """
    """
    try:
        df = pd.read_csv(file_path, header=None, sep='|', names=columns)
        return df
    except Exception as e:
        print(e)

In [18]:
df_departments = read_csv('../data_retail/departments', ['department_id', 'department_name'])

In [19]:
def transform_departments(df):
    """
    """
    if df['department_name'].duplicated().any():
        print('Error: filas duplicadas')
        sys.exit(1) 
    return df

In [20]:
transform_departments(df_departments)

   department_id department_name
0              2         Fitness
1              3        Footwear
2              4         Apparel
3              5            Golf
4              6        Outdoors
5              7        Fan Shop

In [21]:
def transform_customers(df):
    """
    """
    df['customer_email'] = df['customer_email'].str.lower()

    # Validar campo obligatorios

    # customer_fname true
    # customer_lname false
    # cutomer_email false
    if df[['customer_fname', 'customer_lname', 'customer_email']].isnull().any().any():
        print("Datos faltantes en el DataFrame de customers")
        sys.exit(1)
    
    return df

In [22]:
df_customers = read_csv('../data_retail/customers', ["customer_id","customer_fname","customer_lname","customer_email","customer_password","customer_street","customer_city","customer_state","customer_zipcode"])

In [23]:
transform_customers(df_customers).head()

,customer_id,customer_fname,customer_lname,customer_email,customer_password,customer_street,customer_city,customer_state,customer_zipcode
0,1,Richard,Hernandez,xxxxxxxxx,XXXXXXXXX,6303 Heather Plaza,Brownsville,TX,78521
1,2,Mary,Barrett,xxxxxxxxx,XXXXXXXXX,9526 Noble Embers Ridge,Littleton,CO,80126
2,3,Ann,Smith,xxxxxxxxx,XXXXXXXXX,3422 Blue Pioneer Bend,Caguas,PR,725
3,4,Mary,Jones,xxxxxxxxx,XXXXXXXXX,8324 Little Common,San Marcos,CA,92069
4,5,Robert,Hudson,xxxxxxxxx,XXXXXXXXX,10 Crystal River Mall,Caguas,PR,725

In [24]:
def transform_products(df, df_categories):
    """
    """
    # Asegurar que product_category_id exista en categories
    valid_ids = set(df_categories['category_id'])

    if not df['product_category_id'].isin(valid_ids).all():
        print("Hay product_category_id que no existen en category")
        sys.exit(1)

    return df

In [37]:
df_products = read_csv('../data_retail/products', ["product_id","product_category_id","product_name","product_description","product_price","product_image"])

df_categories = read_csv('../data_retail/categories', ["category_id", "category_department_id", "category_name"])

In [26]:
transform_products(df_products, df_categories).head()

,product_id,product_category_id,product_name,product_description,product_price,product_image
0,1,2,Quest Q64 10 FT. x 10 FT. Slant Leg Instant U,NaN,59.98,http://images.acmesports.sports/Quest+Q64+10+F...
1,2,2,Under Armour Men's Highlight MC Football Clea,NaN,129.99,http://images.acmesports.sports/Under+Armour+M...
2,3,2,Under Armour Men's Renegade D Mid Football Cl,NaN,89.99,http://images.acmesports.sports/Under+Armour+M...
3,4,2,Under Armour Men's Renegade D Mid Football Cl,NaN,89.99,http://images.acmesports.sports/Under+Armour+M...
4,5,2,Riddell Youth Revolution Speed Custom Footbal,NaN,199.99,http://images.acmesports.sports/Riddell+Youth+...

In [27]:
def transform_order_items(df, df_orders, df_products):

    # order_item_order_id exista en orders

    valid_id = set(df_orders['order_id'])

    if not df['order_item_order_id'].isin(valid_id).all():
        print("Hay ids que no se encuentran en el DataFrame")
        sys.exit(1)

    # order_item_product_id exista en products

    valid_ids = set(df_products['product_id'])

    if not df['order_item_product_id'].isin(valid_id).all():
        print("Hay ids que no se encuentran en el DataFrame")
        sys.exit(1)

    return df

In [28]:
df_order_items = read_csv('../data_retail/order_items', ["order_item_id","order_item_order_id","order_item_product_id","order_item_quantity","order_item_subtotal","order_item_product_price"])
df_orders = read_csv('../data_retail/orders', ["order_id","order_date","order_customer_id","order_status"])

In [29]:
transform_order_items(df_order_items, df_orders, df_products)

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99
...,...,...,...,...,...,...
172193,172194,68881,403,1,129.99,129.99
172194,172195,68882,365,1,59.99,59.99
172195,172196,68882,502,1,50.00,50.00
172196,172197,68883,208,1,1999.99,1999.99
172197,172198,68883,502,3,150.00,50.00

In [30]:
def validate_ids(df_retail, df, id_retail, id_df ):

    valid_ids = set(df[id_df])

    if not df_retail[id_retail].isin(valid_ids).all():
        print("Hay ids que no se encuentran en el DataFrame")
        sys.exit(1)

In [31]:
def transform_order_items(df, df_orders, df_products):

    # order_item_order_id exista en orders

    validate_ids(df,df_orders, 'order_item_order_id', 'order_id' )

    # order_item_product_id exista en products

    validate_ids(df,df_products, 'order_item_product_id', 'product_id' )

    calculated_subtotal = df['order_item_quantity'] * df['order_item_product_price']
    
    if not (df['order_item_subtotal'] == calculated_subtotal ).all():
        df['order_item_subtotal'] = calculated_subtotal
    

    return df

In [32]:
transform_order_items(df_order_items, df_orders, df_products)

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99
...,...,...,...,...,...,...
172193,172194,68881,403,1,129.99,129.99
172194,172195,68882,365,1,59.99,59.99
172195,172196,68882,502,1,50.00,50.00
172196,172197,68883,208,1,1999.99,1999.99
172197,172198,68883,502,3,150.00,50.00

In [41]:
transform_order_items(df_order_items, df_orders, df_products)

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99
...,...,...,...,...,...,...
172193,172194,68881,403,1,129.99,129.99
172194,172195,68882,365,1,59.99,59.99
172195,172196,68882,502,1,50.00,50.00
172196,172197,68883,208,1,1999.99,1999.99
172197,172198,68883,502,3,150.00,50.00

In [33]:
def load_data(engine, table_name, df):
    """
    """
    df.to_sql(name=table_name, con=engine, if_exists='replace', index=False)

In [34]:
engine = create_db_engine(DATABASE_CONFIG)
load_data(engine, 'categries_2', df_categories)

In [49]:
df_order_items.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 172198 entries, 0 to 172197
Data columns (total 6 columns):
 #   Column                    Non-Null Count   Dtype
---  ------                    --------------   -----
 0   order_item_id             172198 non-null  int64
 1   order_item_order_id       172198 non-null  int64
 2   order_item_product_id     172198 non-null  int64
 3   order_item_quantity       172198 non-null  int64
 4   order_item_subtotal       172198 non-null  float64
 5   order_item_product_price  172198 non-null  float64
dtypes: float64(2), int64(4)
memory usage: 7.9 MB

In [50]:
validate_ids(df_categories, df_departments, 'category_department_id', 'department_id')

Hay ids que no se encuentran en el DataFrame

SystemExit: 1

/home/codespace/.local/lib/python3.12/site-packages/IPython/core/interactiveshell.py:3585: UserWarning: To exit: use 'exit', 'quit', or Ctrl-D.
  warn("To exit: use 'exit', 'quit', or Ctrl-D.", stacklevel=1)